; ModuleID = './kgflags.c'
source_filename = "./kgflags.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { i32, [256 x %struct._kgflags_flag], i32, [512 x ptr], i32, [512 x %struct._kgflags_error], ptr, i32, i32, ptr, ptr }
%struct._kgflags_flag = type { ptr, ptr, %union.anon, %union.anon.0, i8, i8, i8, i32 }
%union.anon = type { ptr }
%union.anon.0 = type { ptr }
%struct._kgflags_error = type { ptr, ptr, i32 }
%struct.kgflags_string_array = type { ptr, i32 }
%struct.kgflags_int_array = type { ptr, i32 }
%struct.kgflags_double_array = type { ptr, i32 }

@.str = private unnamed_addr constant [4 x i8] c"no-\00", align 1, !dbg !0
@_kgflags_g = internal global %struct.anon zeroinitializer, align 8, !dbg !7
@.str.1 = private unnamed_addr constant [3 x i8] c"--\00", align 1, !dbg !40
@stderr = external global ptr, align 8
@.str.2 = private unnamed_addr constant [30 x i8] c"Missing value for flag: %s%s\0A\00", align 1, !dbg !45
@.str.3 = private unnamed_addr constant [25 x i8] c"Unrecognized flag: %s%s\0A\00", align 1, !dbg !50
@.str.4 = private unnamed_addr constant [32 x i8] c"Unassigned required flag: %s%s\0A\00", align 1, !dbg !55
@.str.5 = private unnamed_addr constant [57 x i8] c"Invalid value for flag: %s%s (got %s, expected integer)\0A\00", align 1, !dbg !60

!179 = !{!180}
!180 = !DISubrange(count: 13)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 850, type: !131, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 850, type: !94, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !3, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !2, line: 853, type: !94, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !171, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !2, line: 856, type: !178, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 859, type: !178, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 859, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 19)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 862, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 10)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 862, type: !148, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 865, type: !178, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 865, type: !197, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 867, type: !126, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !111, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 875, type: !148, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 876, type: !94, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 876, type: !131, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 876, type: !136, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !2, line: 877, type: !178, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 878, type: !148, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 880, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 22)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !2, line: 882, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 21)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 885, type: !197, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !2, line: 887, type: !141, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 890, type: !229, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 892, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 24)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 897, type: !47, isLocal: true, isDefinition: true)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 207, size: 213440, elements: !251)
!251 = !{!252, !253, !312, !313, !317, !318, !327, !328, !329, !330, !331}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags_count", scope: !250, file: !2, line: 208, baseType: !38, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !250, file: !2, line: 209, baseType: !254, size: 81920, offset: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 81920, elements: !310)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "_kgflags_flag_t", file: !2, line: 172, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_kgflags_flag", file: !2, line: 150, size: 320, elements: !257)
!257 = !{!258, !261, !262, !271, !305, !306, !307, !308}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !2, line: 151, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !256, file: !2, line: 152, baseType: !259, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !256, file: !2, line: 158, baseType: !263, size: 64, offset: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !2, line: 153, size: 64, elements: !264)
!264 = !{!265, !266, !268, !269}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "string_value", scope: !263, file: !2, line: 154, baseType: !259, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bool_value", scope: !263, file: !2, line: 155, baseType: !267, size: 8)
!267 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "int_value", scope: !263, file: !2, line: 156, baseType: !38, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "double_value", scope: !263, file: !2, line: 157, baseType: !270, size: 64)
!270 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !256, file: !2, line: 167, baseType: !272, size: 64, offset: 192)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !2, line: 159, size: 64, elements: !273)
!273 = !{!274, !276, !278, !280, !282, !291, !298}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "string_value", scope: !272, file: !2, line: 160, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bool_value", scope: !272, file: !2, line: 161, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "int_value", scope: !272, file: !2, line: 162, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "double_value", scope: !272, file: !2, line: 163, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "string_array", scope: !272, file: !2, line: 164, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgflags_string_array_t", file: !2, line: 56, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kgflags_string_array", file: !2, line: 53, size: 128, elements: !286)
!286 = !{!287, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_items", scope: !285, file: !2, line: 54, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_count", scope: !285, file: !2, line: 55, baseType: !38, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "int_array", scope: !272, file: !2, line: 165, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgflags_int_array_t", file: !2, line: 61, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kgflags_int_array", file: !2, line: 58, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_items", scope: !294, file: !2, line: 59, baseType: !288, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_count", scope: !294, file: !2, line: 60, baseType: !38, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "double_array", scope: !272, file: !2, line: 166, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgflags_double_array_t", file: !2, line: 66, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kgflags_double_array", file: !2, line: 63, size: 128, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_items", scope: !301, file: !2, line: 64, baseType: !288, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_count", scope: !301, file: !2, line: 65, baseType: !38, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !256, file: !2, line: 168, baseType: !267, size: 8, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !256, file: !2, line: 169, baseType: !267, size: 8, offset: 264)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "required", scope: !256, file: !2, line: 170, baseType: !267, size: 8, offset: 272)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !256, file: !2, line: 171, baseType: !309, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "_kgflags_flag_kind_t", file: !2, line: 148, baseType: !12)
!310 = !{!311}
!311 = !DISubrange(count: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "non_flag_count", scope: !250, file: !2, line: 211, baseType: !38, size: 32, offset: 81984)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "non_flag_args", scope: !250, file: !2, line: 212, baseType: !314, size: 32768, offset: 82048)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 32768, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "errors_count", scope: !250, file: !2, line: 214, baseType: !38, size: 32, offset: 114816)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !250, file: !2, line: 215, baseType: !319, size: 98304, offset: 114880)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 98304, elements: !315)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "_kgflags_error_t", file: !2, line: 192, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_kgflags_error", file: !2, line: 188, size: 192, elements: !322)
!322 = !{!323, !324, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flag_name", scope: !321, file: !2, line: 189, baseType: !259, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !321, file: !2, line: 190, baseType: !259, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !321, file: !2, line: 191, baseType: !326, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_kgflags_error_kind_t", file: !2, line: 186, baseType: !23)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefix", scope: !250, file: !2, line: 217, baseType: !259, size: 64, offset: 213184)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "arg_cursor", scope: !250, file: !2, line: 219, baseType: !38, size: 32, offset: 213248)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !250, file: !2, line: 220, baseType: !38, size: 32, offset: 213280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !250, file: !2, line: 221, baseType: !288, size: 64, offset: 213312)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "custom_description", scope: !250, file: !2, line: 223, baseType: !259, size: 64, offset: 213376)
!332 = !{i32 7, !"Dwarf Version", i32 5}
!333 = !{i32 2, !"Debug Info Version", i32 3}
!334 = !{i32 1, !"wchar_size", i32 4}
!335 = !{i32 8, !"PIC Level", i32 2}
!336 = !{i32 7, !"PIE Level", i32 2}
!337 = !{i32 7, !"uwtable", i32 2}
!338 = !{i32 7, !"frame-pointer", i32 2}
!339 = !{!"clang version 20.1.8"}
!340 = distinct !DISubprogram(name: "kgflags_string", scope: !2, file: !2, line: 226, type: !341, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !9, retainedNodes: !343)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !259, !259, !259, !267, !275}
!343 = !{}
!344 = !DILocalVariable(name: "name", arg: 1, scope: !340, file: !2, line: 226, type: !259)
!345 = !DILocation(line: 226, column: 33, scope: !340)
!346 = !DILocalVariable(name: "default_value", arg: 2, scope: !340, file: !2, line: 226, type: !259)
!347 = !DILocation(line: 226, column: 51, scope: !340)
!348 = !DILocalVariable(name: "description", arg: 3, scope: !340, file: !2, line: 226, type: !259)
!349 = !DILocation(line: 226, column: 78, scope: !340)
!350 = !DILocalVariable(name: "required", arg: 4, scope: !340, file: !2, line: 226, type: !267)
!351 = !DILocation(line: 226, column: 96, scope: !340)
!352 = !DILocalVariable(name: "out_res", arg: 5, scope: !340, file: !2, line: 226, type: !275)
!353 = !DILocation(line: 226, column: 119, scope: !340)
!354 = !DILocation(line: 227, column: 6, scope: !340)
!355 = !DILocation(line: 227, column: 14, scope: !340)
!356 = !DILocalVariable(name: "flag", scope: !340, file: !2, line: 229, type: !255)
!357 = !DILocation(line: 229, column: 21, scope: !340)
!358 = !DILocation(line: 230, column: 5, scope: !340)
!359 = !DILocation(line: 231, column: 10, scope: !340)
!360 = !DILocation(line: 231, column: 15, scope: !340)
!361 = !DILocation(line: 232, column: 17, scope: !340)
!362 = !DILocation(line: 232, column: 10, scope: !340)
!363 = !DILocation(line: 232, column: 15, scope: !340)
!364 = !DILocation(line: 233, column: 39, scope: !340)
!365 = !DILocation(line: 233, column: 10, scope: !340)
!366 = !DILocation(line: 233, column: 37, scope: !340)
!367 = !DILocation(line: 234, column: 24, scope: !340)
!368 = !DILocation(line: 234, column: 10, scope: !340)
!369 = !DILocation(line: 234, column: 22, scope: !340)
!370 = !DILocation(line: 235, column: 21, scope: !340)
!371 = !DILocation(line: 235, column: 10, scope: !340)
!372 = !DILocation(line: 235, column: 19, scope: !340)
!373 = !DILocation(line: 236, column: 32, scope: !340)
!374 = !DILocation(line: 236, column: 10, scope: !340)
!375 = !DILocation(line: 236, column: 30, scope: !340)
!376 = !DILocation(line: 237, column: 10, scope: !340)
!377 = !DILocation(line: 237, column: 19, scope: !340)
!378 = !DILocation(line: 238, column: 5, scope: !340)
!379 = !DILocation(line: 239, column: 1, scope: !340)
!380 = distinct !DISubprogram(name: "_kgflags_add_flag", scope: !2, file: !2, line: 583, type: !381, scopeLine: 583, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !9, retainedNodes: !343)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !255}
!383 = !DILocalVariable(name: "flag", arg: 1, scope: !380, file: !2, line: 583, type: !255)
!384 = !DILocation(line: 583, column: 47, scope: !380)
!385 = !DILocation(line: 584, column: 32, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !2, line: 584, column: 9)
!387 = !DILocation(line: 584, column: 9, scope: !386)
!388 = !DILocation(line: 584, column: 44, scope: !386)
!389 = !DILocation(line: 585, column: 68, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !2, line: 584, column: 53)
!391 = !DILocation(line: 585, column: 9, scope: !390)
!392 = !DILocation(line: 586, column: 9, scope: !390)
!393 = !DILocation(line: 588, column: 20, scope: !394)
!394 = distinct !DILexicalBlock(scope: !380, file: !2, line: 588, column: 9)
